; domain
(define (domain TPP-Propositional)
(:requirements :strips :typing)
(:types place locatable level - object
  depot market - place
  truck goods - locatable)

(:predicates (loaded ?g - goods ?t - truck ?l - level)
       (ready-to-load ?g - goods ?m - market ?l - level)
       (stored ?g - goods ?l - level)
       (on-sale ?g - goods ?m -  market ?l - level)
       (next ?l1 ?l2 - level)
       (at ?t - truck ?p - place)
       (connected ?p1 ?p2 - place))

(:action drive
 :parameters (?t - truck ?from ?to - place)
 :precondition (and (at ?t ?from) (connected ?from ?to))
 :effect (and (not (at ?t ?from)) (at ?t ?to)))

; ### LOAD ###
; ?l1 is the level of ?g ready to be loaded at ?m before loading
; ?l2 is the level of ?g ready to be loaded at ?m after loading
; ?l3 is the level of ?g in ?t before loading
; ?l4 is the level of ?g in ?t after loading

(:action load
 :parameters (?g - goods ?t - truck ?m - market ?l1 ?l2 ?l3 ?l4 - level)
 :precondition (and (at ?t ?m) (loaded ?g ?t ?l3)
        (ready-to-load ?g ?m ?l2) (next ?l2 ?l1) (next ?l4 ?l3))
 :effect (and (loaded ?g ?t ?l4) (not (loaded ?g ?t ?l3))
        (ready-to-load ?g ?m ?l1) (not (ready-to-load ?g ?m ?l2))))


; ### UNLOAD ###
; ?l1 is the level of ?g in ?t before unloading
; ?l2 is the level of ?g in ?t after unloading
; ?l3 is the level of ?g in ?d before unloading
; ?l4 is the level of ?g in ?d after unloading

(:action unload
 :parameters (?g - goods ?t - truck ?d - depot ?l1 ?l2 ?l3 ?l4 - level)
 :precondition (and (at ?t ?d) (loaded ?g ?t ?l2)
        (stored ?g ?l3) (next ?l2 ?l1) (next ?l4 ?l3))
 :effect (and (loaded ?g ?t ?l1) (not (loaded ?g ?t ?l2))
        (stored ?g ?l4) (not (stored ?g ?l3))))


; ### BUY ###
; ?l1 is the level of ?g on sale at ?m before buying
; ?l2 is the level of ?g on sale at ?m after buying
; ?l3 is the level of ?g ready to be loaded at ?m before buying
; ?l4 is the level of ?g ready to be loaded at ?m after buying

(:action buy
 :parameters (?t - truck ?g - goods ?m - market ?l1 ?l2 ?l3 ?l4 - level)
 :precondition (and (at ?t ?m) (on-sale ?g ?m ?l2) (ready-to-load ?g ?m ?l3)
        (next ?l2 ?l1) (next ?l4 ?l3))
 :effect (and (on-sale ?g ?m ?l1) (not (on-sale ?g ?m ?l2))
        (ready-to-load ?g ?m ?l4) (not (ready-to-load ?g ?m ?l3))))
)

; problem
; Domain designed by Alfonso Gerevini and Alessandro Saetti
; This file has been automatically generated by the generator available from
; http://zeus.ing.unibs.it/ipc-5/generators/index.html

(define (problem TPP)
(:domain TPP-Propositional)
(:objects
  goods1 goods2 goods3 - goods
  truck1 - truck
  market1 - market
  depot1 depot2 - depot
  level0 level1 - level)

(:init
  (next level1 level0)
  (ready-to-load goods1 market1 level0)
  (ready-to-load goods2 market1 level0)
  (ready-to-load goods3 market1 level0)
  (stored goods1 level0)
  (stored goods2 level0)
  (stored goods3 level0)
  (loaded goods1 truck1 level0)
  (loaded goods2 truck1 level0)
  (loaded goods3 truck1 level0)
  (connected depot1 market1)
  (connected market1 depot1)
  (connected depot2 market1)
  (connected market1 depot2)
  (on-sale goods1 market1 level1)
  (on-sale goods2 market1 level1)
  (on-sale goods3 market1 level1)
  (at truck1 depot2))

(:goal (and
  (stored goods1 level1)
  (stored goods2 level1)
  (stored goods3 level1)))

)

; plan
1. (drive truck1 depot2 market1)
   deleted: (at truck1 depot2)
   added: (at truck1 market1)
   goals met: 0 of 3
2. (buy truck1 goods3 market1 level0 level1 level0 level1)
   deleted: (on-sale goods3 market1 level1) (ready-to-load goods3 market1 level0)
   added: (on-sale goods3 market1 level0) (ready-to-load goods3 market1 level1)
   goals met: 0 of 3
3. (load goods3 truck1 market1 level0 level1 level0 level1)
   deleted: (loaded goods3 truck1 level0) (ready-to-load goods3 market1 level1)
   added: (loaded goods3 truck1 level1) (ready-to-load goods3 market1 level0)
   goals met: 0 of 3
4. (buy truck1 goods2 market1 level0 level1 level0 level1)
   deleted: (on-sale goods2 market1 level1) (ready-to-load goods2 market1 level0)
   added: (on-sale goods2 market1 level0) (ready-to-load goods2 market1 level1)
   goals met: 0 of 3
5. (load goods2 truck1 market1 level0 level1 level0 level1)
   deleted: (loaded goods2 truck1 level0) (ready-to-load goods2 market1 level1)
   added: (loaded goods2 truck1 level1) (ready-to-load goods2 market1 level0)
   goals met: 0 of 3
6. (drive truck1 market1 depot2)
   deleted: (at truck1 market1)
   added: (at truck1 depot2)
   goals met: 0 of 3
7. (unload goods3 truck1 depot2 level0 level1 level0 level1)
   deleted: (loaded goods3 truck1 level1) (stored goods3 level0)
   added: (loaded goods3 truck1 level0) (stored goods3 level1)
   goals met: 1 of 3
8. (unload goods2 truck1 depot2 level0 level1 level0 level1)
   deleted: (loaded goods2 truck1 level1) (stored goods2 level0)
   added: (loaded goods2 truck1 level0) (stored goods2 level1)
   goals met: 2 of 3
9. (drive truck1 depot2 market1)
   deleted: (at truck1 depot2)
   added: (at truck1 market1)
   goals met: 2 of 3
10. (buy truck1 goods1 market1 level0 level1 level0 level1)
   deleted: (on-sale goods1 market1 level1) (ready-to-load goods1 market1 level0)
   added: (on-sale goods1 market1 level0) (ready-to-load goods1 market1 level1)
   goals met: 2 of 3
11. (load goods1 truck1 market1 level0 level1 level0 level1)
   deleted: (loaded goods1 truck1 level0) (ready-to-load goods1 market1 level1)
   added: (loaded goods1 truck1 level1) (ready-to-load goods1 market1 level0)
   goals met: 2 of 3
12. (drive truck1 market1 depot2)
   deleted: (at truck1 market1)
   added: (at truck1 depot2)
   goals met: 2 of 3
13. (unload goods1 truck1 depot2 level0 level1 level0 level1)
   deleted: (loaded goods1 truck1 level1) (stored goods1 level0)
   added: (loaded goods1 truck1 level0) (stored goods1 level1)
   goals met: 3 of 3
